# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код

from room_1 import print_room_1 as print1
from room_2 import print_room_2 as print2

print('В комнате room1 живут: ', end='')
print1()
print()
print('В комнате room2 живут: ', end='')
print2()
